Voltage_Cities/app/controllers/users_controller.rb

	def show
		@current_user = current_user
		User.find_each(&:save)
		@user = User.friendly.find(params[:id])
		@posts = @user.posts
		@count= Post.select("city_id" ).where("user_id = #{@user.id}").group("city_id")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
SELECT COUNT("posts"."city_id") AS count_city_id, city_id AS city_id FROM "posts" WHERE (user_id = 3) GROUP BY "posts"."city_id"