app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" JOIN taggings posts_taggings_fc346bf  ON posts_taggings_fc346bf.taggable_id = "posts".id AND posts_taggings_fc346bf.taggable_type = 'Post' AND posts_taggings_fc346bf.tag_id = 2
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('this is a tag'))
---
	def index
		if params[:tag]
			@posts = Post.tagged_with(params[:tag])
		else
			@posts = Post.all

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
	def show
		@city = City.friendly.find(params[:city_id])
		#@user = User.find(params[:user_id])
		@post = Post.find(params[:id])
		@comments= @post.comments
		user_id = @post.user_id
		@user = User.friendly.find(user_id)

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
---
	def new
		@city = City.friendly.find(params[:city_id])

SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asd"], ["content", "asd"], ["user_id", "2"], ["created_at", "2015-11-13 04:23:04.565156"], ["updated_at", "2015-11-13 04:23:04.565156"]]
---
	def create
		@current_user = current_user
		@city = City.friendly.find(params[:city_id])
		post_params = params.require(:post).permit(:title, :location, :content, :tag_list)

		@post = Post.new(post_params)
			if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@post = Post.find(params[:id])
		@city = City.friendly.find(params[:city_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "posts" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "YOYOYOY"], ["content", "HEYEYEYEYEYE"], ["updated_at", "2015-11-14 22:00:36.920013"], ["id", 8]]
UPDATE "tags" SET "taggings_count" = COALESCE("taggings_count", 0) + 1 WHERE "tags"."id" = $1  [["id", 7]]
---
	def update
		@post = Post.find(params[:id])
		@city = City.friendly.find(params[:city_id])
		if @post.update_attributes(params.require(:post).permit(:title, :location, :content, :tag_list))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 8]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 1]]
---
	def destroy
		post = Post.find(params[:id])
		post.destroy
		@city = City.friendly.find(params[:city_id])