app/controllers/users_controller.rb

	def show
		@current_user = current_user
		User.find_each(&:save)
		@user = User.friendly.find(params[:id])
		@posts = @user.posts
		@count= Post.select("city_id" ).where("user_id = #{@user.id}").group("city_id")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", "2"]]

	def edit
		@current_user = current_user
		@user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]

	def update
		@current_user = current_user
		@user = User.friendly.find(params[:id])
		p params.require(:user).permit(:artist_name)['artist_name']
		p  @user
		p  params.require(:user).permit(:oldpassword)
		if @user.try(:authenticate, params.require(:user).permit(:oldpassword)['oldpassword'])

			if @user.update_attributes(params.require(:user).permit(:artist_name, :current_city, :password, :avatar))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "avatar_updated_at" = $1, "avatar_file_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["avatar_updated_at", "2015-11-16 00:21:48.617519"], ["avatar_file_name", "G0080580.JPG"], ["updated_at", "2015-11-16 00:21:50.288112"], ["id", 1]]

	def create
		user_params = params.require(:user).permit(:username, :artist_name, :email, :password, :current_city, :avatar)
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("username", "artist_name", "email", "password_digest", "current_city", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"